Revit 2027 API
RailIndex Enumeration
 The continuous rail position index.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailIndex
Public Enumeration RailIndex
public enum class RailIndex
type RailIndex
Members
Member name | Value | Description
LeftPrimary | 1 |  The rail is a primary rail on the left.
LeftSecondary | 3 |  The rail is a secondary rail on the left.
RightPrimary | 2 |  The rail is a primary rail on the right.
RightSecondary | 4 |  The rail is a secondary rail on the right.
Top | 0 |  The rail is located on the top of the railing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace